tap "bazelbuild/tap"
tap "cloudflare/cloudflare"
tap "getsentry/tools"
tap "git-duet/tap"
tap "github/gh"
tap "hashicorp/internal"
tap "hashicorp/security", "git@github.com:hashicorp/homebrew-security.git"
tap "hashicorp/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "jesseduffield/lazydocker"
tap "kudobuilder/tap"
tap "mvndaemon/mvnd"
tap "owenthereal/upterm"
tap "planetscale/tap"
tap "sergiobenitez/osxct"
tap "weaveworks/tap"
brew "act"
brew "actionlint"
brew "ansible"
brew "webp"
brew "jpeg-xl"
brew "glib"
brew "awscli"
brew "bash"
brew "bat"
brew "python@3.9"
brew "harfbuzz"
brew "openjdk@11"
brew "bazel"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "libtool"
brew "guile"
brew "emacs", restart_service: true
brew "cask"
brew "cdktf"
brew "cmake"
brew "ruby"
brew "cocoapods"
brew "ctop"
brew "libssh2"
brew "curl"
brew "dotnet"
brew "editorconfig"
brew "faas-cli"
brew "leptonica"
brew "libass"
brew "srt"
brew "tesseract"
brew "ffmpeg"
brew "fish"
brew "gcc"
brew "gdk-pixbuf"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-delta"
brew "git-extras"
brew "git-lfs"
brew "glib-networking"
brew "gnu-sed"
brew "libusb"
brew "gnupg"
brew "go@1.18"
brew "gobject-introspection"
brew "gradle"
brew "librsvg"
brew "graphviz"
brew "py3cairo"
brew "gstreamer"
brew "hcl2json"
brew "helm"
brew "libheif"
brew "imagemagick"
brew "inframap"
brew "jless"
brew "jq"
brew "kind"
brew "krb5"
brew "kubernetes-cli"
brew "libfido2"
brew "libslirp"
brew "libssh"
brew "qemu"
brew "lima"
brew "llvm"
brew "lsd"
brew "python@3.10"
brew "magic-wormhole"
brew "mas"
brew "maven"
brew "mitmproxy"
brew "mtr"
brew "mysql"
brew "mysql-client"
brew "nghttp2"
brew "numpy"
brew "nvm"
brew "parallel"
brew "pipenv"
brew "postgresql@14"
brew "pre-commit"
brew "pstree"
brew "pybind11"
brew "pyenv"
brew "qpdf"
brew "qrencode"
brew "redis"
brew "ripgrep"
brew "rsync"
brew "rustup-init"
brew "scipy"
brew "shellcheck"
brew "shfmt"
brew "skaffold"
brew "spotify-tui"
brew "spotifyd"
brew "terraform-docs"
brew "terraform-inventory"
brew "terraform@0.13"
brew "tfenv"
brew "tldr"
brew "tmux"
brew "tree"
brew "vault"
brew "watch"
brew "wget"
brew "xgboost"
brew "yq"
brew "z"
brew "cloudflare/cloudflare/cloudflared"
brew "getsentry/tools/sentry-cli"
brew "git-duet/tap/git-duet"
brew "hashicorp/internal/tfcdev"
brew "hashicorp/security/doormat-cli"
brew "hashicorp/security/tsccr-helper"
brew "hashicorp/tap/copywrite"
brew "hashicorp/tap/nomad"
brew "heroku/brew/heroku"
brew "mvndaemon/mvnd/mvnd"
brew "owenthereal/upterm/upterm"
brew "planetscale/tap/pscale"
brew "sergiobenitez/osxct/x86_64-unknown-linux-gnu"
cask "1password"
cask "alfred"
cask "banking-4"
cask "caffeine"
cask "discord"
cask "docker"
cask "finch"
cask "flux"
cask "flycut"
cask "focusrite-control"
cask "font-hack-nerd-font"
cask "github"
cask "goland"
cask "google-chrome"
cask "google-chrome-canary"
cask "google-cloud-sdk"
cask "handbrake"
cask "iterm2"
cask "monodraw"
cask "moom"
cask "notion"
cask "numi"
cask "obs"
cask "obsidian"
cask "pocket-casts"
cask "portfolioperformance"
cask "postman"
cask "rescuetime"
cask "skype"
cask "slack"
cask "slack-cli"
cask "spectacle"
cask "spotify"
cask "switchresx"
cask "tableplus"
cask "vagrant"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc-nightly"
cask "zoom"
cask "zsa-wally"
mas "Cleaner-App", id: 1013897218
mas "Focus To-Do", id: 1258530160
mas "GarageBand", id: 682658836
mas "GIPHY CAPTURE", id: 668208984
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "MoneyMoney", id: 872698314
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Telegram", id: 747648890
mas "The Unarchiver", id: 425424353
mas "WhatsApp", id: 1147396723
mas "Xcode", id: 497799835
vscode "bmalehorn.vscode-fish"
vscode "ChakrounAnas.turbo-console-log"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "euskadi31.json-pretty-printer"
vscode "GitHub.codespaces"
vscode "GitHub.copilot"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "golang.go"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "lifeart.vscode-ember-unstable"
vscode "mohsen1.prettify-json"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsliveshare.vsliveshare-pack"
vscode "oliversturm.fix-json"
vscode "pmneo.tsimporter"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "RescueTime.rescuetime"
vscode "RobbOwen.synthwave-vscode"
vscode "rust-lang.rust-analyzer"
vscode "serayuzgur.crates"
vscode "Shopify.ruby-lsp"
vscode "sorbet.sorbet-vscode-extension"
vscode "tchayen.markdown-links"
vscode "timonwong.shellcheck"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "ZainChen.json"
vscode "ziyasal.vscode-open-in-github"
