tap "bazelbuild/tap"
tap "cloudflare/cloudflare"
tap "getsentry/tools"
tap "git-duet/tap"
tap "github/gh"
tap "hashicorp/internal"
tap "hashicorp/releng"
tap "hashicorp/security", "git@github.com:hashicorp/homebrew-security.git"
tap "hashicorp/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "jesseduffield/lazydocker"
tap "kudobuilder/tap"
tap "mvndaemon/mvnd"
tap "oven-sh/bun"
tap "owenthereal/upterm"
tap "planetscale/tap"
tap "sergiobenitez/osxct"
tap "weaveworks/tap"
# Run your GitHub Actions locally
brew "act"
# Static checker for GitHub Actions workflow files
brew "actionlint"
# Cryptographic recipes and primitives for Python
brew "cryptography"
# C library SSHv1/SSHv2 client and server protocols
brew "libssh"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Nuke a whole AWS account and delete all its resources
brew "aws-nuke"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# C library implementing the SSH2 protocol
brew "libssh2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Core application library for C
brew "glib"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Emacs text editor
brew "emacs", restart_service: true
# Emacs dependency management
brew "cask"
# Cross-platform make
brew "cmake"
# Top-like interface for container metrics
brew "ctop"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Debugger for the Go programming language
brew "delve"
# Text processing system for reStructuredText
brew "docutils"
# .NET Core
brew "dotnet"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Maintain consistent coding style between multiple editors
brew "editorconfig"
# OpenType text shaping engine
brew "harfbuzz"
# Image processing and image analysis library
brew "leptonica"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Secure Reliable Transport
brew "srt"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# GNU compiler collection
brew "gcc"
# Library for encoding and decoding .avif files
brew "libavif"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Automatic git commit --fixup
brew "git-absorb"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Small git utilities
brew "git-extras"
# Git extension for versioning large files
brew "git-lfs"
# Network related modules for glib
brew "glib-networking"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Library for USB device access
brew "libusb"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Development kit for the Java programming language
brew "openjdk"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Image manipulation
brew "netpbm"
# Library to render SVG files using Cairo
brew "librsvg"
# Generic library support script
brew "libtool"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Kubernetes package manager
brew "helm"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Command-line pager for JSON data
brew "jless"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Run local Kubernetes cluster in Docker
brew "kind"
# Network authentication protocol
brew "krb5"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# General purpose TCP-IP emulator
brew "libslirp"
# Next-gen compiler infrastructure
brew "llvm"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Open source relational database management system
brew "mysql"
# Open source relational database management system
brew "mysql-client"
# Node version management
brew "n"
# Development kit for the Java programming language
brew "openjdk@11"
# Shell command parallelization utility
brew "parallel"
# Python dependency management tool
brew "pipenv"
# Object-relational database system
brew "postgresql@14"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Show ps output as a tree
brew "pstree"
# Python 3 bindings for the Cairo graphics library
brew "py3cairo"
# Seamless operability between C++11 and Python
brew "pybind11"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# Rust toolchain installer
brew "rustup-init"
# Fast and accurate code counter with complexity and COCOMO estimates
brew "scc"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Tool to generate documentation from Terraform modules
brew "terraform-docs"
# Go app which generates a dynamic Ansible inventory from a Terraform state file
brew "terraform-inventory"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Tracks most-used directories to make cd smarter
brew "z"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Sentry command-line client for some generic tasks
brew "getsentry/tools/sentry-cli"
# Pairing tool for Git
brew "git-duet/tap/git-duet"
# tfcdev -- Terraform Commercial development automation tooling
brew "hashicorp/internal/tfcdev"
# A tool for triggering on-prem staging and production releases for repositories that have onboarded to Common Release Tooling (CRT)
brew "hashicorp/releng/bob"
# Doormat CLI -- Command Line Interface to the Doormat Service
brew "hashicorp/security/doormat-cli"
# Managing trust for components used in HashiCorp supply chain
brew "hashicorp/security/tsccr-helper"
# copywrite -- utilities for managing copyright headers and license files for GitHub repos
brew "hashicorp/tap/copywrite"
# Nomad
brew "hashicorp/tap/nomad"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Maven Daemon
brew "mvndaemon/mvnd/mvnd"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# x86_64 Linux GNU Toolchain
brew "sergiobenitez/osxct/x86_64-unknown-linux-gnu"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# GPU-accelerated terminal emulator
cask "alacritty"
# German accounting software
cask "banking-4"
# Utility that prevents the system from going to sleep
cask "caffeine"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker"
# Screen colour temperature controller
cask "flux"
# Clipboard manager for developers
cask "flycut"
# Focusrite interface controller
cask "focusrite-control"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Desktop client for GitHub repositories
cask "github"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Tool to create text-based art
cask "monodraw"
# App to write, plan, collaborate, and get organised
cask "notion"
# Calendar for professionals and teams
cask "notion-calendar"
# Calculator and converter application
cask "numi"
# Open-source software for live streaming and screen recording
cask "obs"
# Podcast platform
cask "pocket-casts"
# Collaboration platform for API development
cask "postman"
# HTTP debugging proxy
cask "proxyman"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Time optimising application
cask "rescuetime"
# Music streaming service
cask "spotify"
# Controls screen display settings
cask "switchresx"
# Native GUI tool for relational databases
cask "tableplus"
# Development environment
cask "vagrant"
# Open-source code editor
cask "visual-studio-code"
# Open-source cross-platform multimedia player
cask "vlc-nightly"
# Multiplayer code editor
cask "zed-preview"
mas "1Password for Safari", id: 1569813296
mas "Cleaner-App", id: 1013897218
mas "Focus To-Do", id: 1258530160
mas "GarageBand", id: 682658836
mas "GIPHY CAPTURE", id: 668208984
mas "Hidden Bar", id: 1452453066
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "MoneyMoney", id: 872698314
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Screen Recorder", id: 1661261167
mas "Session", id: 1521432881
mas "Telegram", id: 747648890
mas "The Unarchiver", id: 425424353
mas "WhatsApp", id: 1147396723
mas "Xcode", id: 497799835
vscode "bmalehorn.vscode-fish"
vscode "chakrounanas.turbo-console-log"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "euskadi31.json-pretty-printer"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "lifeart.vscode-ember-unstable"
vscode "mohsen1.prettify-json"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "oliversturm.fix-json"
vscode "pmneo.tsimporter"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "robbowen.synthwave-vscode"
vscode "rust-lang.rust-analyzer"
vscode "serayuzgur.crates"
vscode "shopify.ruby-lsp"
vscode "sorbet.sorbet-vscode-extension"
vscode "streetsidesoftware.code-spell-checker"
vscode "tchayen.markdown-links"
vscode "timonwong.shellcheck"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "zainchen.json"
vscode "ziyasal.vscode-open-in-github"
vscode "zxh404.vscode-proto3"
